app/controllers/items_controller.rb

INSERT INTO "items" ("title", "description", "image_url", "finished", "star", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    respond_to do |format|
      if @item.save

UPDATE "items" SET "image_url" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_url", "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2553707144.jpg"], ["updated_at", "2019-07-16 04:20:00.513373"], ["id", 34]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)